[
  {
    "id": 2,
    "image": "/brent-knudsen/brent-knudsen-activity@3x.png",
    "colorImage": "/brent-knudsen/brent-knudsen-activity@3x.png",
    "coverImage": "/brent-knudsen/brent-_kudenson_cover.jpg",
    "name": "Brent Knudsen",
    "designation": "Founder & Managing Partner ",
    "short_description": "Brent is an avid athlete and lover of the outdoors having competed in skiing, swimming, tennis, bike racing, distance running and triathlons with a personal best marathon of 2:40 (NY 1982) and personal best Ironman of 9:58 (Canada 1989). Brent’s favorite passion is time with his three children, five grandchildren, and beautiful wife of over 35 years.",
    "long_description": "Brent Knudsen is Managing Partner and founder of Partnership Capital Growth. Prior to founding Partnership Capital Growth in 2006, Brent was one of the original partners at North Castle Partners, a leading private equity firm targeting investments in healthy living. Prior to joining North Castle in 1997, Brent invested in and ran a number of growth companies in the healthy living arena including GolfWeb (sold to CBS Sportsline), Full Force (sold to Specialized Bicycles) and Newport Surf Company (sold to Pacific Eyes & T’s). From 1985 to 1994, Brent served as the original Vice President of Marketing & Business Development at Price Club and held the same position at Costco Wholesale immediately prior to, during, and after the merger of the two companies. During his tenure, the company grew from a small San Diego retailer to an international business with over $20B in revenue (over $100B today). From 1983 to 1985, Brent was a management consultant with Bain & Company,where he focused primarily on health care.",
    "long_description2": "Brent attended Brigham Young University and the University of Utah where he graduated magna cum laude with BA and BS degrees in 1980. He later attended Harvard and Georgetown Law Schools where he received a JD degree in 1983. He has served as a visiting lecturer at the Center for Entrepreneurial Studies at the Stanford Graduate School of Business, Chairman of the BYU Management Society Advisory Board, is an investment advisor for Telluride Venture Accelerator and serves as a lay leader in The Church of Jesus Christ of Latter Day Saints.",
    "email": "mailto:brent@pcg-investors.com",
    "linkedin": "https://www.linkedin.com/in/brent-knudsen-a126782/",
    "emailIcon": "/email_green.svg",
    "emailAlt": "Email Icon",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Brent Knudsen"
  },
  {
    "id": 6,
    "image": "/vern-christensen/Vern-Christensen-Formal@3x.png",
    "colorImage": "/vern-christensen/Vern-Christensen-Formal@3x.png",
    "coverImage": "/vern-christensen/Vern-Christensen-Action@3x.png",
    "name": "Vern Christensen",
    "designation": "Managing Director",
    "short_description": "Vern has always enjoyed sports and outdoor activities. Growing up on a farm he learned valuable lessons about hard work and making things grow. Most importantly, he learned that you need to work as hard as you play, a philosophy he still treasures. Today he enjoys skiing, hiking, fishing and camping with his children and grandchildren. He lives in Salt Lake City with his wife of over 40 years, conveniently close to many great outdoor activities. ",
    "long_description": "Prior to joining Partnership Capital Growth, Vern managed business development at Nutraceutical Corporation, completing some 40 acquisitions of VMS and natural and organic health and beauty brands, including Aubrey Organics, Dynamic Health, Zhou Nutrition, Nature’s Herbs, Heritage Store, BioGenesis, Honey Gardens, and Emerita. Vern began his professional career at Texas Commerce Bank, where he managed the bank’s South American Section and the U.S. Western Division. He subsequently joined Creditanstalt-Bankverein’s New York office to manage a corporate finance team and the Special Asset Group, focusing on financing, debt and equity, for leveraged buyouts, mergers, acquisitions and structured financings. Returning to his home state of Utah he co-founded Outlook Capital and worked with middle market companies on mergers, acquisitions, turnarounds and recapitalizations.\n\n He served as CFO for Deluxe Ice Cream and Respond, Inc., two portfolio companies managed by Outlook Capital. Vern received a B.A. from Brigham Young University and a Master’s of International Management from the American Graduate School of International Management (Thunderbird). ",
    "email": "mailto:vern@pcg-investors.com",
    "linkedin": "https://www.linkedin.com/in/vern-christensen-a752b85/",
    "emailIcon": "/email_green.svg",
    "emailAlt": "Email Icon",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Vern Christensen"
  },
  {
    "id": 7,
    "image": "/webb-knudsen/Webb Knudsen Formal@3x.png",
    "colorImage": "/webb-knudsen/Webb Knudsen Formal@3x.png",
    "coverImage": "/webb-knudsen/webb_knudsen_cover_img.jpg",
    "name": "Webb Knudsen",
    "designation": "Vice President",
    "short_description": "Webb has a multifaceted background in entertainment, social media, and mobile working across sales, business development, and marketing capacities to drive profitability and optimize market strategy for movies, brands, and apps. He graduated from Pepperdine with a dual major in Sociology and Speech Communication. He's a dad to 3, dog lover, snowboarder, entrepreneur, and lucky husband of Deanna.",
    "long_description": "Webb Knudsen is Vice President at PCG and also leads the KC/LLC family office that he founded and manages with his father as an advisor. As an operator, Webb has a multifaceted background across entertainment, social media, and mobile working across sales, business development, and marketing capacities to drive profitability and optimize market strategy for movies, brands, and apps.\n\n He got his career start in the entertainment industry - first at the production company Walden Media, then Hollywood's biggest agency CAA, and finally moved to Lucasfilm before making the jump over to the tech industry. Webb spearheaded west coast growth for Crisp as VP Business Development and previously led US sales teams for Aarki and Millennial Reach. He has founded 2 startups and is currently leading kids toy + AR startup Playper as CEO. Webb graduated from Pepperdine University with a dual major in Sociology & Speech Communication. He is a dad, dog lover, snowboarder, and has lived in 4 countries and 18 cities.",
    "email": "mailto:webb@pcg-investors.com",
    "linkedin": "https://www.linkedin.com/in/webbknudsen/",
    "emailIcon": "/email_green.svg",
    "emailAlt": "Email Icon",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Webb Knudsen"
  },
  {
    "id": 5,
    "image": "/suise_lecker/suise_lecker_color.jpg",
    "colorImage": "/suise_lecker/suise_lecker_color.jpg",
    "coverImage": "/suise_lecker/susie_lecker_cover.jpg",
    "name": "Susie Lecker",
    "designation": "Advisor",
    "short_description": "Canadian by birth, Susie is “living the dream” in Southern California with a view of the ocean. Susie has a deep love of travel - and curiosity about different cultures. To that end - she has visited all but one of the world’s continents. Aside from travel, Susie meditates daily, loves the beach, pilates, hiking, and spending time with her dog.",
    "long_description": "Susie is a seasoned, authentic executive with a background in CPG and proficiency in the Toy Licensing Industries. Her career has spanned 25 years in marketing and general management leadership roles across multiple consumer packaged goods industries with a focus on Children’s brands. She has extensive experience in developing & scaling new brands/products, leading cross functional teams, successfully managing relationships and P&L’s. She built her career at Mattel, where she acted as EVP/Chief Brands officer for Mattel’s Toybox, a $2B division and growth engine for the company. In that capacity, she represented Mattel across all the company’s licensed entertainment properties with industry leading partners like Nickelodeon, Disney, Warner Brothers, Universal and WWE – as well as driving trend inspired innovation in toy development. \n \n Susie is passionate about both the Kids and Wellness industries, and where they intersect. She is dedicated to working on purposeful brands, using her professional and personal experience to broaden awareness of the importance of physical, mental, and spiritual fitness at every age, to do her part to make the world and healthier, happier place.",
    "email": "",
    "emailAlt": "",
    "linkedin": "",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Susie Lecker"
  },
  {
    "id": 3,
    "image": "/Hiren_Modi/Hiren-Modi-Formal.png",
    "colorImage": "/Hiren_Modi/Hiren-Modi-Formal.png",
    "coverImage": "/Hiren_Modi/Hiren_Modi_Action_Shot.jpg",
    "name": "Hiren Modi",
    "designation": "Fund Finance",
    "short_description": "Hiren is a Chartered Accountant and CPA who is passionate about people and numbers. He brings expertise in various facets of audit, taxation and accounting. He grew up in a small town, imbibing the qualities of persistence and hard work. He is a passionate leader and an inspirational speaker. He lives in San Francisco and enjoys spending time with his wife and daughters.",
    "long_description": "Hiren has been a Certified Public Accountant and member of the American Institute of Certified Public Accountants since 2000. Hiren is a past member AICP’s stock brokerage and investment banking expert panel. Hiren has nearly 20 years of extensive experience in all areas of accounting and auditing. In particular, he serves a large number of broker-dealers, domestic and offshore hedge funds, real estate funds, technology, and not- for-profit companies. Hiren has completed the Series 27 examination of the Financial Industry Regulatory Authority and has served as Financial and Operational Principal (Fin-Op) for several boutique broker-dealers and option traders.\n\n Hiren’s previous experience includes serving as a Staff Accountant and, later, a Supervisor at a regional accounting firm in India, where he was involved in the audits of large domestic and foreign publicly-traded companies, local mutual funds and stockbrokers. ",
    "email": "#section5",
    "emailAlt": "",
    "linkedin": "https://www.linkedin.com/in/hiren-modi-0393692/",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Hiren Modi"
  },
  {
    "id": 4,
    "image": "/jason-winship/Jason_Winship_Formal.jpeg",
    "colorImage": "/jason-winship/Jason_Winship_Formal.jpeg",
    "coverImage": "/jason-winship/Jason-Winship-Activity.png",
    "name": "Jason Winship",
    "designation": "Advisor",
    "short_description": "A lifelong athlete, Jason was a four year varsity football letterman and an academic all American at Rice. These days, he enjoys surfing, skiing and taking his dog for runs in the beautiful outdoor places of Northern California that he, his wife Annie, and their three children call home.",
    "long_description": "Jason Winship is a advisor at Partnership Capital Growth Investors. His work includes deal sourcing and evaluation, transaction execution and portfolio monitoring. Jason has led numerous transactions in the natural and organic foods industry, and brings over 20 years of corporate finance, principal investment, and M&A experience to the PCGI team. Prior to joining Partnership Capital Growth Investors in 2010, Jason was the managing principal and co-founder of Sea Change Management, LLC. Launched in 2005, Sea Change is a venture capital firm that seeks to generate strong financial returns by investing in companies that meet consumer demand for seafood from environmentally preferable sources.\n\n Prior to his time with Sea Change, and its sister organization, California Environmental Associates, Jason was a Senior Associate with Westbury Equity Partners, a New York-based $150 million growth equity fund. In that capacity, he sourced, assessed, and executed early-stage private equity investments and supported portfolio companies with strategic and financial analysis. Prior to his tenure with Westbury, Jason sourced and executed international merger and acquisition opportunities for AT&T Wireless. Jason began his career as an investment banking analyst with Lehman Brothers, where he participated in a wide range of corporate financing and M&A transactions. Jason holds a Bachelor of Arts degree from Rice University.",
    "email": "mailto:jason@pcg-investors.com",
    "linkedin": "https://www.linkedin.com/in/jason-winship-9b886b3/",
    "emailIcon": "/email_green.svg",
    "emailAlt": "Email Icon",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Jason Winship"
  },
  {
    "id": 1,
    "image": "/ben_weinberger/ben_weinberger_color.jpg",
    "colorImage": "/ben_weinberger/ben_weinberger_color.jpg",
    "coverImage": "/ben_weinberger/ben_weinberger_cover.jpg",
    "name": "Ben Weinberger",
    "designation": "Advisor",
    "short_description": "Ben thrives on travel and new adventures with his wife and daughter. Whether they are skiing, exploring mountain trails with their dog, avidly watching college basketball or enjoying the beach, Ben and family frequently are making memories together. Ben also takes on home renovation projects and is passionate about a variety of facets within the real estate industry.",
    "long_description": "Ben’s 20-year career spans roles as founder, CEO and Chief Product Officer building and scaling direct to consumer, digital media and technology businesses. He formerly served as founding Chief Product Officer at Sling TV where he helped redefine the next generation of television scaling to millions of subscribers. Prior to Sling TV, Ben was the co-founder and CEO of Digitalsmiths, the product leader in the field of video search, recommendations and personalization. Under his leadership, Digitalsmiths developed video discovery solutions that have been adopted by several of the biggest names in cable, satellite, telco and broadcast media. In 2014, Digitalsmiths was acquired by TiVo for $135 million. \n \n Ben currently serves as an advisor to the sports media, sports gaming and human performance fund- Drive by DraftKings as well as helping operate TBD Angels. He is on the board of directors of Mobivity (MFON), Librestream Technologies and FrndlyTV. Ben graduated with honors from the Department of Radio and Television at Southern Illinois University Carbondale in 2001.",
    "email": "",
    "emailAlt": "",
    "linkedin": "",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Ben Weinberger"
  },
  {
    "id": 10,
    "image": "/team_members/nicholai/Nicholai_Headshot.jpg",
    "colorImage": "/team_members/nicholai/Nicholai_Headshot.jpg",
    "coverImage": "/team_members/nicholai/Nicholai_Action Shot.jpg",
    "name": "Nicholai Christensen",
    "designation": "Analyst",
    "short_description": "Nicholai is a parent to three wonderful children who are a source inspiration and motivation. Outside of professional and family life, Nicholai is a board game enthusiast, regularly organizing game nights with friends and family. This hobby not only provides a fun and competitive outlet but also fosters a sense of community and strategic thinking.",
    "long_description": "Nicholai has an educational background in Mathematics and Economics, having studied at both Brigham Young University and Utah Valley University. From his academic journey, he developed an understanding of analytical and quantitative methods, which they have applied in various professional and personal contexts. During their time at BYU, Nicholai worked at IDeA Labs, where he honed skills in innovation and problem-solving, working on several cutting-edge projects. \n \n Currently at PCG, Nicholai specializes in data analytics, reviewing the financials of prospective investments and monitoring the performance of current portfolio companies. His role involves analyzing data sets to provide actionable insights, ensuring that investment decisions are well-informed and strategically sound.",
    "email": "nicholai@pcg-investors.com",
    "linkedin": "",
    "emailIcon": "/email_green.svg",
    "emailAlt": "Email Icon",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Nicholai Christensen"
  },
  {
    "id": 8,
    "image": "/team_members/micheal_sala/michael_sala_headshot.jpg",
    "colorImage": "/team_members/micheal_sala/michael_sala_headshot.jpg",
    "coverImage": "/team_members/micheal_sala/michel_sala_action_shot.jpg",
    "name": "Michael Sala",
    "designation": "Advisor",
    "short_description": "Michael seeks creative inspiration from everywhere including his love of travelling, taking photos while exploring cities or discovering something inspiring while simply out for a walk or hike. Michael and his wife Noriko lived in NYC and now sunny LA where they enjoy design, art & are passionate foodies. Michael loves trying new things & being surrounded by smart & creative thinkers.",
    "long_description": "Michael brings a strong sense of play to every project and is a passionate and optimistic leader with extensive experience in creating and optimizing children's products and entertainment. \n \n Michael is both creative and strategic and keeps the consumer at the center of ideation. He has worked with LEGO and Fisher-Price, injecting innovative thinking into their teams. As Design VP, he led the growth of major franchises like PAW Patrol, Gabby's Dollhouse, Unicorn Academy, Harry Potter and Hatchimals. \n \n Michael excels in new brand creation and managing relationships with studios like Disney, Netflix, Nickelodeon, NBC/U, BBC, and Warner Bros. Currently, he is the Chief Product Officer at Toy + AR startup Playper.  A graduate of FIT's Toy Design program, he enjoys mentoring emerging talent and sharing his expertise with design colleges.     ",
    "email": "",
    "linkedin": "",
    "emailIcon": "/email_green.svg",
    "emailAlt": "Email Icon",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Michael Sala"
  },
  {
    "id": 9,
    "image": "/team_members/vicki_wiget/Vicki_Wiget_Headshot.jpg",
    "colorImage": "/team_members/vicki_wiget/Vicki_Wiget_Headshot.jpg",
    "coverImage": "/team_members/vicki_wiget/Vicki_Wiget_Action_Shot.jpg",
    "name": "Vicki Wiget",
    "designation": "Executive Assistant",
    "short_description": "Raised in Chico, California, Vicki attended CSU Chico - then lived in the Santa Cruz area for many years where she raised her family and assisted her husband in his work. She has lived in Los Gatos for over 10 years. Vicki has a deep love of the outdoors.  She enjoys fishing like her dad taught her, hiking, and visiting warm places where she can snorkel. She is committed to working out at a gym to help her stay healthy. ",
    "long_description": "Vicki is passionate about helping others grow and to assist with helping to make their businesses run smoothly. Vicki has spent many years doing a variety of volunteer work including leading personal growth classes, helping local nonprofits including the local police department with events and fundraisers. She has over 20 years of experience working with small businesses, individuals, and entrepreneurs to streamline their bookkeeping and assure accuracy. \n \n Vicki’s professional background includes duties of CFO for Al Shugart, a CEO of a venture capital business, and as a manager at his Seagate Technologies company. \n \n She is experienced in assuming all responsibilities of Administrator to Construction Project Managers, Executives and as a property manager for various clients. \n \n Vicki specializes in bringing smaller businesses into a higher level of organization, profitability, and on-time submittals of all government filings. ",
    "email": "",
    "linkedin": "",
    "emailIcon": "/email_green.svg",
    "emailAlt": "Email Icon",
    "linkedinIcon": "/linkedin_green.svg",
    "alt": "Vicki Wiget"
  }
]
